node {
  name: "image_tensor"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 300
        }
        dim {
          size: 300
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "Preprocessor/mul"
  op: "Mul"
  input: "image_tensor"
  input: "Preprocessor/mul/x"
}
node {
  name: "Preprocessor/sub"
  op: "Sub"
  input: "Preprocessor/mul"
  input: "Preprocessor/sub/y"
}
node {
  name: "FeatureExtractor/MobilenetV2/Conv/Conv2D"
  op: "Conv2D"
  input: "Preprocessor/sub"
  input: "FeatureExtractor/MobilenetV2/Conv/weights/read/_27__cf__30"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/Conv/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/Conv/Conv2D"
  input: "FeatureExtractor/MobilenetV2/Conv/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/Conv/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/Conv/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/Conv/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/depthwise_weights/read/_37__cf__40"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/read/_34__cf__37"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/read/_33__cf__36"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/read/_35__cf__38"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/read/_36__cf__39"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/weights/read/_42__cf__45"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/output"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/output"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/weights/read/_52__cf__55"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/depthwise_weights/read/_47__cf__50"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/gamma/read/_44__cf__47"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/beta/read/_43__cf__46"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/moving_mean/read/_45__cf__48"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/moving_variance/read/_46__cf__49"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/weights/read/_57__cf__60"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/output"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/output"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/weights/read/_172__cf__175"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/depthwise_weights/read/_167__cf__170"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/gamma/read/_164__cf__167"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/beta/read/_163__cf__166"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/moving_mean/read/_165__cf__168"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/moving_variance/read/_166__cf__169"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/weights/read/_177__cf__180"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/output"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/weights/read/_187__cf__190"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/depthwise_weights/read/_182__cf__185"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/gamma/read/_179__cf__182"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/beta/read/_178__cf__181"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/moving_mean/read/_180__cf__183"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/moving_variance/read/_181__cf__184"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/weights/read/_192__cf__195"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/output"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/output"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/weights/read/_202__cf__205"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/depthwise_weights/read/_197__cf__200"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/gamma/read/_194__cf__197"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/beta/read/_193__cf__196"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/moving_mean/read/_195__cf__198"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/moving_variance/read/_196__cf__199"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/weights/read/_207__cf__210"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/BatchNorm/FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/output"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/weights/read/_217__cf__220"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/depthwise_weights/read/_212__cf__215"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/gamma/read/_209__cf__212"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/beta/read/_208__cf__211"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/moving_mean/read/_210__cf__213"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/moving_variance/read/_211__cf__214"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/weights/read/_222__cf__225"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/BatchNorm/FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/input"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/weights/read/_232__cf__235"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/depthwise_weights/read/_227__cf__230"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/gamma/read/_224__cf__227"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/beta/read/_223__cf__226"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/moving_mean/read/_225__cf__228"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/moving_variance/read/_226__cf__229"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/weights/read/_237__cf__240"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/output"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/output"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/weights/read/_247__cf__250"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/depthwise_weights/read/_242__cf__245"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/gamma/read/_239__cf__242"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/beta/read/_238__cf__241"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/moving_mean/read/_240__cf__243"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/moving_variance/read/_241__cf__244"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/weights/read/_252__cf__255"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/BatchNorm/FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/output"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/weights/read/_262__cf__265"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/depthwise_weights/read/_257__cf__260"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/gamma/read/_254__cf__257"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/beta/read/_253__cf__256"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/moving_mean/read/_255__cf__258"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/moving_variance/read/_256__cf__259"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/weights/read/_267__cf__270"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/BatchNorm/FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/input"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/weights/read/_277__cf__280"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/depthwise_weights/read/_272__cf__275"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/gamma/read/_269__cf__272"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/beta/read/_268__cf__271"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/moving_mean/read/_270__cf__273"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/moving_variance/read/_271__cf__274"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/weights/read/_282__cf__285"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/BatchNorm/FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/input"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/weights/read/_67__cf__70"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/depthwise_weights/read/_62__cf__65"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/gamma/read/_59__cf__62"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/beta/read/_58__cf__61"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/moving_mean/read/_60__cf__63"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/moving_variance/read/_61__cf__64"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/weights/read/_72__cf__75"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/output"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/output"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/weights/read/_82__cf__85"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/depthwise_weights/read/_77__cf__80"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/gamma/read/_74__cf__77"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/beta/read/_73__cf__76"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/moving_mean/read/_75__cf__78"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/moving_variance/read/_76__cf__79"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/weights/read/_87__cf__90"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/BatchNorm/FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/output"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_12/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/weights/read/_97__cf__100"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/BatchNorm/FusedBatchNorm"
  op: "BiasAdd"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/Conv2D_bn_offset"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/depthwise_weights/read/_92__cf__95"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/gamma/read/_89__cf__92"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/beta/read/_88__cf__91"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/moving_mean/read/_90__cf__93"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/moving_variance/read/_91__cf__94"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/FusedBatchNorm"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_12/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_12/project/weights/read/_102__cf__105"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
